Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--t-rex_overview.tmx
Source language: en
Languages: ja

source: Vector Tile Service
ja: ベクタータイルサービス

source: t-rex is a vector tile server specialized on publishing MVT tiles from your own data.
ja: t-rexは、独自のデータからMVTタイルを配信することに特化したベクタータイルサーバです。

source: Core Features
ja: 主要機能

source: Support for PostGIS databases and GDAL vector formats
ja: PostGISデータベースとGDALベクターフォーマットのサポート

source: Auto-detection of layers in data source
ja: データソース内のレイヤーの自動検出

source: Built-in viewers for data display and inspection
ja: データ表示および検査用の組み込みビューア

source: Tile generation command with simple parallelization
ja: シンプルな並列化によるタイル生成コマンド

source: Automatic reprojection to grid CRS
ja: グリッドCRSへの自動再投影

source: Support for custom tile grids
ja: カスタムタイルグリッドのサポート

source: Details
ja: 詳細

source: **Website:** https://t-rex.tileserver.ch/
ja: **ウェブサイト:** https://t-rex.tileserver.ch/

source: **Licence:** `MIT license <https://opensource.org/licenses/MIT>`_
ja: **ライセンス:** `MIT license <https://opensource.org/licenses/MIT>`_

source: **Software Version:** |version-t-rex|
ja: **ソフトウェアバージョン:**version-t-rex

source: **Supported Platforms:** Windows, Linux, Mac
ja: **対応プラットフォーム:** Windows, Linux, Mac

source: **API Interfaces:** http, Mapbox Vector Tiles
ja: **APIインターフェイス:** http, Mapbox Vector Tiles

source: **Support:** https://github.com/t-rex-tileserver/t-rex/
ja: **サポート:** https://github.com/t-rex-tileserver/t-rex/

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/t-rex_quickstart>`
ja: :doc:`クイックスタートドキュメント<./quickstart/t-rex_quickstart>`
